app/controllers/api/v1/meeting_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."email" = 'Cristiano Ronaldo' LIMIT 1
---
  def start_session
    # 2.2 Version
    tokbox_session = OTSDK.create_session
    tokbox_session_id = tokbox_session.session_id
    # tokbox_token = tokbox_session.generate_token
    # :expire_time => Time.now.to_i+(7 * 24 * 60 * 60) # in one week
    # :expire_time => Time.now.to_i+(1 * 60 * 60) # in 1 day


    # tokbox_token = tokbox_session.generate_token({
    #     :expire_time => Time.now.to_i+(1 * 1 * 60 * 60)
    #   })
    tokbox_token = "TTT"

    #tokbox_session = OTSDK.createSession(request.remote_ip, {:media_mode => :relayed})
    # tokbox_session = OTSDK.createSession(request.remote_ip, {OpenTok::SessionPropertyConstants::P2P_PREFERENCE => "enabled"})
    # tokbox_session_id = tokbox_session.session_id
    # tokbox_token = tokbox_session.generateToken

    # tokbox_session_id = "1_MX40NDcxNDAwMn5-TW9uIEFwciAwNyAwNjowMDo0MiBQRFQgMjAxNH4wLjg0NjA3MTJ-fg"
    # tokbox_token = "T1==cGFydG5lcl9pZD00NDcxNDAwMiZzZGtfdmVyc2lvbj10YnJ1YnktdGJyYi12MC45MS4yMDExLTAyLTE3JnNpZz1lMjQ3ZWY0MjYzYzFlY2U1NjMxN2ZiNjgwZDg5ZWU3NWI5NTliOWRmOnJvbGU9cHVibGlzaGVyJnNlc3Npb25faWQ9MV9NWDQwTkRjeE5EQXdNbjUtVFc5dUlFRndjaUF3TnlBd05qb3dNRG8wTWlCUVJGUWdNakF4Tkg0d0xqZzBOakEzTVRKLWZnJmNyZWF0ZV90aW1lPTEzOTY4NzU2NDMmbm9uY2U9MC44MDA5MDEyMjgyOTgzMTExJmV4cGlyZV90aW1lPTEzOTY5NjIwNDMmY29ubmVjdGlvbl9kYXRhPQ=="

    user = current_user

    to_user = User.find_by_email(params[:email])

INSERT INTO "meetings" ("created_at", "pusher_channel", "tokbox_session_id", "tokbox_token", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    }
    @meeting = Meeting.new(@session_data)

    if @meeting.save

SELECT  "meetings".* FROM "meetings"  WHERE "meetings"."id" = 41 LIMIT 1
---
  def join_session

    user = current_user

    channel = params[:channel]
    @meeting = Meeting.find_by_id(channel)

SELECT  "meetings".* FROM "meetings"  WHERE "meetings"."id" = 0 LIMIT 1
UPDATE "meetings" SET "is_expired" = $1, "updated_at" = $2 WHERE "meetings"."id" = 19  [["is_expired", "t"], ["updated_at", "2014-10-23 08:48:26.894405"]]
---
  def end_session

    user = current_user
    channel = params[:channel]


    @meeting = Meeting.find_by_id(channel)
    @meeting.update_attribute(:is_expired, true)