app/controllers/contacts_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.where.not(id: current_user.id)