app/controllers/meeting_controller.rb

  def channel

    @meeting = Meeting.where(:id => params[:channel]).first
---
SELECT  "meetings".* FROM "meetings"  WHERE "meetings"."id" = 41  ORDER BY "meetings"."id" ASC LIMIT 1